In [1]:
##1. Import Pandas Library

In [1]:
import pandas as pd

In [2]:
##2. Read CSV file

In [29]:
df = pd.read_csv("Ireland Avg Earnings per Week.csv", skiprows=[1])
df.head()

,Unnamed: 0,All manual employee grades,Skilled operatives,Apprentices,Unskilled and semi-skilled - adults,Unskilled and semi-skilled - juveniles,Clerical employees - female,Clerical employees - male,Foremen and supervisors,All employees (clerical and operatives)
0,1969Q1,NaN,25.24,NaN,21.34,NaN,NaN,NaN,NaN,NaN
1,1969Q2,NaN,27.59,NaN,23.41,NaN,NaN,NaN,NaN,NaN
2,1969Q3,26.0,30.77,12.63,24.71,11.44,14.01,22.33,35.4,25.56
3,1969Q4,NaN,29.48,NaN,23.20,NaN,NaN,NaN,NaN,NaN
4,1970Q1,NaN,29.97,NaN,24.19,NaN,NaN,NaN,NaN,NaN

In [30]:
df.shape

(160, 10)

In [31]:
##3.Data Cleaning

In [32]:
df.columns.values

array(['Unnamed: 0', 'All manual employee grades', 'Skilled operatives',
       'Apprentices', 'Unskilled and semi-skilled - adults',
       'Unskilled and semi-skilled - juveniles',
       'Clerical employees - female', 'Clerical employees - male',
       'Foremen and supervisors',
       'All employees (clerical and operatives)'], dtype=object)

In [33]:
df.dtypes

Unnamed: 0                                  object
All manual employee grades                 float64
Skilled operatives                         float64
Apprentices                                float64
Unskilled and semi-skilled - adults        float64
Unskilled and semi-skilled - juveniles     float64
Clerical employees - female                float64
Clerical employees - male                  float64
Foremen and supervisors                     object
All employees (clerical and operatives)    float64
dtype: object

In [8]:
##3.1 renaming columns

In [34]:
df=df.rename(columns={'Unnamed: 0': 'Year_Quarter', 'All manual employee grades':'Manual_employee_grades',
            'Skilled operatives':'Skilled_operatives','Unskilled and semi-skilled - adults':'Semi_skilled_adults',
            'Unskilled and semi-skilled - juveniles':'Semi_skilled_juveniles',
            'Clerical employees - female':'Clerical_employees_female',
            'Clerical employees - male':'Clerical_employees_male',
            'Foremen and supervisors':'Foremen_and_supervisors',
            'All employees (clerical and operatives)':'Clerical_and_Operatives'})

In [35]:
df.head()

,Year_Quarter,Manual_employee_grades,Skilled_operatives,Apprentices,Semi_skilled_adults,Semi_skilled_juveniles,Clerical_employees_female,Clerical_employees_male,Foremen_and_supervisors,Clerical_and_Operatives
0,1969Q1,NaN,25.24,NaN,21.34,NaN,NaN,NaN,NaN,NaN
1,1969Q2,NaN,27.59,NaN,23.41,NaN,NaN,NaN,NaN,NaN
2,1969Q3,26.0,30.77,12.63,24.71,11.44,14.01,22.33,35.4,25.56
3,1969Q4,NaN,29.48,NaN,23.20,NaN,NaN,NaN,NaN,NaN
4,1970Q1,NaN,29.97,NaN,24.19,NaN,NaN,NaN,NaN,NaN

In [36]:
## 3.2 Slipt Year_Quarter in to Year and Quarter

In [37]:
df['Year and Quarter'] =df['Year_Quarter'].str.replace(r'(\w{4})',r'\1-',regex=True).str.strip('\-')
df[['Year','Quarter']] = df['Year and Quarter'].str.split('-',expand=True)
df = df.drop(['Year_Quarter','Year and Quarter'], axis=1)

In [38]:
## 3.3 Reorder columns

In [39]:
df=df[["Year","Quarter","Manual_employee_grades","Skilled_operatives","Apprentices","Semi_skilled_adults","Clerical_employees_female",
       "Clerical_employees_male","Foremen_and_supervisors","Clerical_and_Operatives"]]

In [40]:
df.head()

,Year,Quarter,Manual_employee_grades,Skilled_operatives,Apprentices,Semi_skilled_adults,Clerical_employees_female,Clerical_employees_male,Foremen_and_supervisors,Clerical_and_Operatives
0,1969,Q1,NaN,25.24,NaN,21.34,NaN,NaN,NaN,NaN
1,1969,Q2,NaN,27.59,NaN,23.41,NaN,NaN,NaN,NaN
2,1969,Q3,26.0,30.77,12.63,24.71,14.01,22.33,35.4,25.56
3,1969,Q4,NaN,29.48,NaN,23.20,NaN,NaN,NaN,NaN
4,1970,Q1,NaN,29.97,NaN,24.19,NaN,NaN,NaN,NaN

In [41]:
## 3.4 find any missing values

In [42]:
df.isnull().sum()

Year                          0
Quarter                       0
Manual_employee_grades       39
Skilled_operatives            0
Apprentices                  39
Semi_skilled_adults           0
Clerical_employees_female    39
Clerical_employees_male      39
Foremen_and_supervisors      39
Clerical_and_Operatives      39
dtype: int64

In [43]:
## 3.5 impute the missing values with forwardfill and backwordfill

In [44]:
df = df.fillna(method='ffill')

In [45]:
df = df.fillna(method='backfill')

In [46]:
## Testing again missing values after impute 
df.isnull().sum()

Year                         0
Quarter                      0
Manual_employee_grades       0
Skilled_operatives           0
Apprentices                  0
Semi_skilled_adults          0
Clerical_employees_female    0
Clerical_employees_male      0
Foremen_and_supervisors      0
Clerical_and_Operatives      0
dtype: int64

In [47]:
## 3.6 Data preparation

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       160 non-null    object
 1   Quarter                    160 non-null    object
 2   Manual_employee_grades     160 non-null    float64
 3   Skilled_operatives         160 non-null    float64
 4   Apprentices                160 non-null    float64
 5   Semi_skilled_adults        160 non-null    float64
 6   Clerical_employees_female  160 non-null    float64
 7   Clerical_employees_male    160 non-null    float64
 8   Foremen_and_supervisors    160 non-null    object
 9   Clerical_and_Operatives    160 non-null    float64
dtypes: float64(7), object(3)
memory usage: 12.6+ KB

In [50]:
df['Foremen_and_supervisors']=df['Foremen_and_supervisors'].str.replace(',','') ## replace ',' with ''

In [ ]:
## 3.7 converting object and float Dtypes to int.

In [51]:
df= df.astype({'Year':'int', 'Quarter':'category','Manual_employee_grades':'int','Skilled_operatives':'int','Apprentices':'int',
              'Semi_skilled_adults':'int','Clerical_employees_female':'int','Clerical_employees_male':'int','Clerical_and_Operatives':'int'})

In [52]:
df["Foremen_and_supervisors"]=df["Foremen_and_supervisors"].astype('float64')

In [53]:
df["Foremen_and_supervisors"]=df["Foremen_and_supervisors"].astype('int')

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160 entries, 0 to 159
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       160 non-null    int32
 1   Quarter                    160 non-null    category
 2   Manual_employee_grades     160 non-null    int32
 3   Skilled_operatives         160 non-null    int32
 4   Apprentices                160 non-null    int32
 5   Semi_skilled_adults        160 non-null    int32
 6   Clerical_employees_female  160 non-null    int32
 7   Clerical_employees_male    160 non-null    int32
 8   Foremen_and_supervisors    160 non-null    int32
 9   Clerical_and_Operatives    160 non-null    int32
dtypes: category(1), int32(9)
memory usage: 6.1 KB

In [54]:
df.tail()

,Year,Quarter,Manual_employee_grades,Skilled_operatives,Apprentices,Semi_skilled_adults,Clerical_employees_female,Clerical_employees_male,Foremen_and_supervisors,Clerical_and_Operatives
155,2007,Q4,878,946,529,838,545,724,1094,842
156,2008,Q1,861,920,495,829,540,724,1079,829
157,2008,Q2,842,912,490,803,544,719,1086,813
158,2008,Q3,848,919,531,799,543,762,1102,820
159,2008,Q4,855,913,535,796,540,760,1083,822

In [23]:
##4 Dataframe export

In [24]:
#1. convert all rows into a list of tuples

In [56]:
y = []

for i in range(len(df)):
    x = tuple(df.iloc[i])
    y.append(x)
y

[(1969, 'Q1', 26, 25, 12, 21, 14, 22, 35, 25),
 (1969, 'Q2', 26, 27, 12, 23, 14, 22, 35, 25),
 (1969, 'Q3', 26, 30, 12, 24, 14, 22, 35, 25),
 (1969, 'Q4', 26, 29, 12, 23, 14, 22, 35, 25),
 (1970, 'Q1', 26, 29, 12, 24, 14, 22, 35, 25),
 (1970, 'Q2', 26, 30, 12, 25, 14, 22, 35, 25),
 (1970, 'Q3', 27, 31, 12, 26, 15, 25, 36, 27),
 (1970, 'Q4', 27, 32, 12, 26, 15, 25, 36, 27),
 (1971, 'Q1', 27, 36, 12, 30, 15, 25, 36, 27),
 (1971, 'Q2', 27, 36, 12, 30, 15, 25, 36, 27),
 (1971, 'Q3', 32, 37, 15, 31, 19, 29, 42, 32),
 (1971, 'Q4', 32, 38, 15, 31, 19, 29, 42, 32),
 (1972, 'Q1', 32, 41, 15, 33, 19, 29, 42, 32),
 (1972, 'Q2', 32, 41, 15, 34, 19, 29, 42, 32),
 (1972, 'Q3', 38, 44, 18, 37, 21, 32, 48, 37),
 (1972, 'Q4', 38, 44, 18, 36, 21, 32, 48, 37),
 (1973, 'Q1', 38, 46, 18, 38, 21, 32, 48, 37),
 (1973, 'Q2', 38, 46, 18, 39, 21, 32, 48, 37),
 (1973, 'Q3', 42, 48, 20, 41, 24, 40, 55, 41),
 (1973, 'Q4', 42, 50, 20, 42, 24, 40, 55, 41),
 (1974, 'Q1', 46, 53, 21, 45, 27, 42, 61, 45),
 (1974, 'Q2', 46, 55, 21, 46, 27, 42, 61, 45),
 (1974, 'Q3', 50, 56, 26, 49, 32, 41, 64, 49),
 (1974, 'Q4', 50, 57, 26, 49, 32, 41, 64, 49),
 (1975, 'Q1', 55, 62, 31, 54, 32, 50, 68, 54),
 (1975, 'Q2', 55, 66, 31, 58, 32, 50, 68, 54),
 (1975, 'Q3', 60, 68, 34, 60, 37, 57, 77, 59),
 (1975, 'Q4', 60, 71, 34, 61, 37, 57, 77, 59),
 (1976, 'Q1', 61, 68, 36, 59, 40, 62, 82, 60),
 (1976, 'Q2', 61, 70, 36, 60, 40, 62, 82, 60),
 (1976, 'Q3', 71, 79, 43, 70, 42, 65, 92, 70),
 (1976, 'Q4', 71, 81, 43, 70, 42, 65, 92, 70),
 (1977, 'Q1', 77, 87, 47, 74, 47, 71, 94, 75),
 (1977, 'Q2', 77, 90, 47, 78, 47, 71, 94, 75),
 (1977, 'Q3', 85, 96, 52, 84, 51, 76, 103, 83),
 (1977, 'Q4', 85, 92, 52, 79, 51, 76, 103, 83),
 (1978, 'Q1', 87, 100, 54, 83, 53, 79, 110, 85),
 (1978, 'Q2', 87, 105, 54, 89, 53, 79, 110, 85),
 (1978, 'Q3', 96, 109, 57, 94, 56, 81, 119, 94),
 (1978, 'Q4', 96, 112, 57, 91, 56, 81, 119, 94),
 (1979, 'Q1', 103, 117, 58, 100, 64, 89, 132, 101),
 (1979, 'Q2', 103, 124, 58, 108, 64, 89, 132, 101),
 (1979, 'Q3', 118, 136, 67, 115, 69, 94, 145, 116),
 (1979, 'Q4', 118, 136, 67, 114, 69, 94, 145, 116),
 (1980, 'Q1', 129, 145, 71, 127, 77, 106, 167, 127),
 (1980, 'Q2', 129, 155, 71, 133, 77, 106, 167, 127),
 (1980, 'Q3', 136, 150, 79, 136, 85, 121, 175, 134),
 (1980, 'Q4', 136, 166, 79, 148, 85, 121, 175, 134),
 (1981, 'Q1', 147, 162, 84, 148, 96, 135, 187, 145),
 (1981, 'Q2', 147, 187, 84, 161, 96, 135, 187, 145),
 (1981, 'Q3', 165, 188, 92, 159, 103, 145, 208, 162),
 (1981, 'Q4', 165, 182, 92, 160, 103, 145, 208, 162),
 (1982, 'Q1', 180, 206, 101, 171, 109, 159, 235, 177),
 (1982, 'Q2', 180, 206, 101, 184, 109, 159, 235, 177),
 (1982, 'Q3', 194, 217, 112, 191, 112, 161, 242, 190),
 (1982, 'Q4', 194, 219, 112, 186, 112, 161, 242, 190),
 (1983, 'Q1', 189, 213, 112, 184, 118, 171, 233, 185),
 (1983, 'Q2', 189, 217, 112, 182, 118, 171, 233, 185),
 (1983, 'Q3', 202, 229, 120, 194, 122, 182, 253, 198),
 (1983, 'Q4', 202, 230, 120, 196, 122, 182, 253, 198),
 (1984, 'Q1', 212, 241, 126, 203, 128, 188, 254, 208),
 (1984, 'Q2', 212, 241, 126, 203, 128, 188, 254, 208),
 (1984, 'Q3', 215, 239, 129, 210, 129, 185, 265, 211),
 (1984, 'Q4', 215, 243, 129, 210, 129, 185, 265, 211),
 (1985, 'Q1', 211, 236, 126, 200, 133, 192, 263, 206),
 (1985, 'Q2', 211, 241, 126, 215, 133, 192, 263, 206),
 (1985, 'Q3', 232, 261, 135, 219, 139, 194, 286, 227),
 (1985, 'Q4', 232, 255, 135, 211, 139, 194, 286, 227),
 (1986, 'Q1', 221, 247, 140, 207, 147, 199, 275, 216),
 (1986, 'Q2', 233, 259, 151, 221, 151, 210, 294, 229),
 (1986, 'Q3', 238, 261, 152, 228, 151, 208, 301, 233),
 (1986, 'Q4', 235, 259, 152, 219, 151, 209, 303, 229),
 (1987, 'Q1', 234, 258, 149, 219, 151, 208, 304, 229),
 (1987, 'Q2', 231, 257, 147, 214, 151, 209, 305, 225),
 (1987, 'Q3', 236, 262, 148, 219, 155, 211, 306, 231),
 (1987, 'Q4', 239, 264, 148, 223, 154, 211, 312, 233),
 (1988, 'Q1', 241, 264, 151, 227, 155, 215, 318, 235),
 (1988, 'Q2', 240, 263, 141, 228, 156, 218, 311, 235),
 (1988, 'Q3', 250, 272, 155, 240, 159, 222, 318, 244),
 (1988, 'Q4', 248, 275, 155, 234, 158, 226, 320, 243),
 (1989, 'Q1', 243, 267, 151, 234, 161, 222, 310, 238),
 (1989, 'Q2', 251, 278, 150, 243, 165, 223, 320, 246),
 (1989, 'Q3', 259, 290, 155, 249, 166, 232, 326, 254),
 (1989, 'Q4', 260, 288, 156, 247, 173, 234, 336, 255),
 (1990, 'Q1', 260, 289, 158, 248, 171, 239, 338, 254),
 (1990, 'Q2', 261, 290, 156, 250, 175, 241, 348, 256),
 (1990, 'Q3', 275, 309, 158, 262, 181, 245, 364, 269),
 (1990, 'Q4', 273, 307, 157, 259, 184, 248, 365, 268),
 (1991, 'Q1', 272, 302, 152, 260, 190, 261, 374, 267),
 (1991, 'Q2', 275, 309, 159, 262, 187, 261, 374, 269),
 (1991, 'Q3', 289, 321, 172, 278, 188, 265, 384, 282),
 (1991, 'Q4', 293, 330, 174, 279, 195, 264, 385, 286),
 (1992, 'Q1', 295, 333, 171, 281, 201, 267, 381, 288),
 (1992, 'Q2', 313, 357, 185, 297, 203, 273, 397, 305),
 (1992, 'Q3', 322, 365, 198, 307, 205, 273, 401, 314),
 (1992, 'Q4', 330, 377, 194, 308, 211, 284, 421, 322),
 (1993, 'Q1', 326, 370, 196, 305, 208, 284, 420, 318),
 (1993, 'Q2', 323, 366, 201, 299, 209, 279, 421, 315),
 (1993, 'Q3', 329, 372, 215, 305, 214, 280, 428, 320),
 (1993, 'Q4', 337, 384, 224, 304, 214, 295, 438, 328),
 (1994, 'Q1', 343, 389, 208, 316, 219, 291, 447, 333),
 (1994, 'Q2', 335, 371, 206, 317, 215, 292, 447, 326),
 (1994, 'Q3', 354, 391, 213, 338, 221, 301, 458, 344),
 (1994, 'Q4', 375, 423, 218, 356, 241, 308, 473, 365),
 (1995, 'Q1', 368, 412, 217, 348, 236, 316, 470, 358),
 (1995, 'Q2', 363, 409, 215, 342, 232, 309, 482, 353),
 (1995, 'Q3', 371, 414, 223, 347, 232, 329, 485, 361),
 (1995, 'Q4', 378, 431, 226, 344, 235, 346, 498, 369),
 (1996, 'Q1', 381, 434, 220, 355, 245, 358, 502, 372),
 (1996, 'Q2', 379, 420, 221, 358, 244, 365, 518, 370),
 (1996, 'Q3', 391, 445, 228, 376, 255, 364, 538, 382),
 (1996, 'Q4', 400, 454, 242, 366, 267, 379, 535, 392),
 (1997, 'Q1', 404, 462, 244, 365, 269, 391, 540, 396),
 (1997, 'Q2', 409, 464, 256, 373, 272, 401, 560, 401),
 (1997, 'Q3', 423, 479, 255, 388, 288, 411, 567, 415),
 (1997, 'Q4', 478, 577, 279, 409, 298, 436, 626, 467),
 (1998, 'Q1', 440, 525, 264, 386, 288, 431, 594, 431),
 (1998, 'Q2', 460, 548, 293, 394, 305, 421, 629, 450),
 (1998, 'Q3', 452, 540, 271, 404, 298, 408, 610, 442),
 (1998, 'Q4', 458, 544, 268, 406, 304, 423, 609, 448),
 (1999, 'Q1', 451, 535, 261, 400, 291, 411, 615, 441),
 (1999, 'Q2', 468, 560, 280, 409, 297, 411, 617, 457),
 (1999, 'Q3', 516, 615, 309, 473, 303, 450, 668, 502),
 (1999, 'Q4', 531, 631, 305, 476, 322, 452, 712, 518),
 (2000, 'Q1', 520, 624, 300, 468, 323, 469, 694, 508),
 (2000, 'Q2', 533, 619, 306, 504, 344, 478, 696, 521),
 (2000, 'Q3', 554, 642, 318, 534, 338, 494, 718, 540),
 (2000, 'Q4', 607, 704, 328, 578, 353, 476, 772, 588),
 (2001, 'Q1', 579, 664, 327, 556, 352, 476, 721, 562),
 (2001, 'Q2', 587, 670, 358, 555, 355, 495, 753, 570),
 (2001, 'Q3', 612, 684, 386, 592, 371, 495, 767, 595),
 (2001, 'Q4', 638, 705, 392, 618, 393, 519, 780, 618),
 (2002, 'Q1', 644, 725, 374, 624, 388, 523, 788, 624),
 (2002, 'Q2', 657, 749, 372, 629, 400, 528, 828, 637),
 (2002, 'Q3', 685, 794, 422, 643, 405, 547, 861, 664),
 (2002, 'Q4', 674, 767, 417, 632, 413, 526, 845, 652),
 (2003, 'Q1', 678, 768, 410, 632, 421, 572, 846, 657),
 (2003, 'Q2', 687, 785, 424, 645, 412, 558, 853, 664),
 (2003, 'Q3', 693, 779, 428, 659, 423, 572, 867, 672),
 (2003, 'Q4', 715, 814, 435, 659, 442, 572, 920, 691),
 (2004, 'Q1', 699, 782, 403, 653, 440, 597, 872, 678),
 (2004, 'Q2', 720, 824, 415, 667, 449, 597, 892, 698),
 (2004, 'Q3', 734, 840, 433, 681, 454, 626, 905, 712),
 (2004, 'Q4', 749, 835, 450, 703, 469, 642, 955, 726),
 (2005, 'Q1', 757, 853, 444, 705, 467, 671, 977, 737),
 (2005, 'Q2', 780, 871, 460, 738, 489, 669, 1007, 758),
 (2005, 'Q3', 769, 885, 450, 712, 475, 648, 975, 745),
 (2005, 'Q4', 799, 896, 456, 746, 511, 659, 1015, 776),
 (2006, 'Q1', 766, 855, 431, 722, 494, 638, 958, 743),
 (2006, 'Q2', 785, 882, 427, 739, 490, 655, 992, 761),
 (2006, 'Q3', 793, 884, 437, 753, 501, 665, 1000, 768),
 (2006, 'Q4', 819, 885, 472, 791, 499, 695, 1021, 793),
 (2007, 'Q1', 811, 882, 445, 781, 513, 695, 1038, 784),
 (2007, 'Q2', 827, 909, 463, 790, 526, 704, 1049, 800),
 (2007, 'Q3', 848, 922, 487, 823, 528, 712, 1070, 818),
 (2007, 'Q4', 878, 946, 529, 838, 545, 724, 1094, 842),
 (2008, 'Q1', 861, 920, 495, 829, 540, 724, 1079, 829),
 (2008, 'Q2', 842, 912, 490, 803, 544, 719, 1086, 813),
 (2008, 'Q3', 848, 919, 531, 799, 543, 762, 1102, 820),
 (2008, 'Q4', 855, 913, 535, 796, 540, 760, 1083, 822)]

In [ ]:
##2.Save the list as a txt file

In [57]:
file = open('Ireland_Avg_Earnings.txt', 'w')

for tuple in y:
    file.write(str(tuple) + ',' + '\n')

file.close()

In [ ]:
#pip install pandas mysql-connector-python

In [ ]:
import pandas as pd
import mysql.connector

In [ ]:
connection = mysql.connector.connect(
host="localhost",
user="root",
password="ParklandsRow7*",
database="ireland_avg_earnings"
)

In [ ]:
query = "SELECT * FROM avg_earnings"

In [ ]:
df = pd.read_sql(query, connection);

In [ ]:
df.head()